Hieromon/AutoConnect/examples/WebCamServer/ESP32Cam.cpp
  return rc;
}

/**
 * Take a one-shot image and save it to the SD card.
 * This function writes to a file compliant with the following SD library,
 * and the SD card must be connected to the ESP32 module via SPI.
 * https://github.com/espressif/arduino-esp32/tree/master/libraries/SD
 * @param  sd        fs::SDFS instance that handles the destination SD card.
 * @param  filename  File name for saving the captured image.
 * @return ESP_OK    Image file saved.
 * @return ESP_ERR_INVALID_STATE  SD card is not mounted.
 * @return ESP_FAIL  Any other error occurred.
 */
esp_err_t ESP32Cam::oneShot(fs::SDFS& sd, const char* filename) {
  // Allow one-shot writes even if SD.begin() is not running in the user sketch.
  // To do so, it detects the card mount state only once and tries to start the
  // SD file system.
  if (!_autoMount(MOUNT_SD, reinterpret_cast<fs::FS*>(&sd)))
    return ESP_ERR_INVALID_STATE;
  return _oneShot(filename);
}

/**
 * Take a one-shot image and save it to the MMC.
 * This function writes to a file compliant with the following SD library,
 * and The SD card needs to be connected to the ESP32 module via HS2 wiring.
 * https://github.com/espressif/arduino-esp32/tree/master/libraries/SD
 * @param  mmc       fs::SDMMCFS instance that handles the destination MMC.
 * @param  filename  File name for saving the captured image.
 * @return ESP_OK    Image file saved.
 * @return ESP_ERR_INVALID_STATE  SD card is not mounted.
 * @return ESP_FAIL  Any other error occurred.
 */
esp_err_t ESP32Cam::oneShot(fs::SDMMCFS& mmc, const char* filename) {
  // Allow one-shot writes even if SDMMC.begin() is not running in the user
  // sketch. To do so, it detects the card mount state only once and tries to
  // start the SDMMC file system.
  if (!_autoMount(MOUNT_SDMMC, reinterpret_cast<fs::FS*>(&mmc)))
    return ESP_ERR_INVALID_STATE;
  return _oneShot(filename);
}

/**
 * Exclusively get semaphore and output the image from the image sensor to a
 * file. If the filename parameter is nullptr, it will assume a file name with
 * a timestamp prefixed with a fixed string defined by
 * the ESP32CAM_GLOBAL_IDENTIFIER macro.
 * @param  sd        fs::FS filesystem
 * @param  filename  File name for saving the captured image.
 * @return ESP_OK    Image file saved.
 * @return ESP_FAIL  Any other error occurred.
 */
esp_err_t ESP32Cam::_oneShot(const char* filename) {
  char  fn[sizeof(ESP32CAM_GLOBAL_IDENTIFIER) + 20]{"/" ESP32CAM_GLOBAL_IDENTIFIER};
  // Assume the file name to be written
  if (!filename) {
    _appendTimestamp(fn);
    filename = fn;
  }
  if (!strlen(filename)) {
    _appendTimestamp(fn);
    filename = fn;
  }

  // Start taking a one-shot
  esp_err_t rc = ESP_FAIL;
  if (enq(portMAX_DELAY) == pdTRUE) {
    rc = _export(filename, nullptr);
    deq();
  }
  return rc;
}

/**
 * Repeatedly takes a one-shot image at a specified cycle and saves it to the
 * SD card. Saves the captured image to a file whose name consists of the
 * prefix and timestamp suffix specified by the filename argument. If the
 * filename argument does not exist, the prefix will be assumed a fixed string
 * defined by the ESP32CAM_GLOBAL_IDENTIFIER macro directive in ESP32Cam.h.
 * This function writes to a file compliant with the following SD library,
 * and the SD card must be connected to the ESP32 module via SPI.
 * https://github.com/espressif/arduino-esp32/tree/master/libraries/SD
 * @param  period         Period to shoot in seconds.
 * @param  sd             fs::SD filesystem
 * @param  filenamePrefix File name for saving the captured image.
 * @return ESP_OK         Image file saved.
 * @return ESP_FAIL       Any other error occurred.
 */
esp_err_t ESP32Cam::timerShot(const unsigned long period, fs::SDFS& sd, const char* filenamePrefix) {
  // Allow one-shot writes even if SD.begin() is not running in the user sketch.
  // To do so, it detects the card mount state only once and tries to start the
  // SD file system.
  if (!_autoMount(MOUNT_SD, reinterpret_cast<fs::FS*>(&sd)))
    return ESP_ERR_INVALID_STATE;
  _timerShot(period, filenamePrefix);
  return ESP_OK;
}

/**
 * Repeatedly takes a one-shot image at a specified cycle and saves it to the
 * MMC. Saves the captured image to a file whose name consists of the prefix
 * and timestamp suffix specified by the filename argument. If the filename
 * argument does not exist, the prefix will be assumed a fixed string defined
 * by the ESP32CAM_GLOBAL_IDENTIFIER macro directive in ESP32Cam.h.
 * This function writes to a file compliant with the following SD library,
 * and The SD card needs to be connected to the ESP32 module via HS2 wiring.
 * https://github.com/espressif/arduino-esp32/tree/master/libraries/SD
 * @param  period         Period to shoot in seconds.
 * @param  mmc            fs::SDMMC filesystem
 * @param  filenamePrefix File name for saving the captured image.
 * @return ESP_OK         Image file saved.
 * @return ESP_FAIL       Any other error occurred.
 */
esp_err_t ESP32Cam::timerShot(const unsigned long period, fs::SDMMCFS& mmc, const char* filenamePrefix) {
  // Allow one-shot writes even if SDMMC.begin() is not running in the user
  // sketch. To do so, it detects the card mount state only once and tries to
  // start the SDMMC file system.
  if (!_autoMount(MOUNT_SDMMC, reinterpret_cast<fs::FS*>(&mmc)))
    return ESP_ERR_INVALID_STATE;
  _timerShot(period, filenamePrefix);
  return ESP_OK;
}

/**
 * Exclusively get semaphore and repeatedly takes a one-shot image.
 * The cycle for the timer shot is generated by the hardware timer provided by
 * the ESP32 module. This function initializes the timer for periodic execution
 * of the timer interrupt function for taking pictures.
 * @param  period         Period to shoot in seconds.
 * @param  filenamePrefix File name for saving the captured image.
 */
void ESP32Cam::_timerShot(const unsigned long period, const char* filenamePrefix) {
  if (!period)
    return;

  if (!filenamePrefix)
    filenamePrefix = "/" ESP32CAM_GLOBAL_IDENTIFIER;
  if (!strlen(filenamePrefix))
    filenamePrefix = "/" ESP32CAM_GLOBAL_IDENTIFIER;

