Hieromon/AutoConnect/examples/WebCamServer/ESP32Cam.cpp
  // Save the global variables for the ISR and cancel the timer residue.
  _captureName = filenamePrefix;
  _purgeTimer();

  // Register a task to secure and shoot a hardware timer.
  _hwTimer = timerBegin(ESP32CAM_OCCUPIED_TIMER, getApbFrequency() / 1000000UL, true);
  timerAttachInterrupt(_hwTimer, &ESP32Cam::_timerShotISR, true);
  timerAlarmWrite(_hwTimer, period * 1000000UL, true);

  // Start an alarm
  ESP32Cam_internal::esp32cam = this;
  xSemaphoreGive(ESP32Cam_internal::xMutex);
  timerAlarmEnable(_hwTimer);
}

/**
 * A hardware timer interrupt routine is called when the shooting cycle of the
 * timerShot is reached. Since this ISR needs to finish with minimal processing,
 * it only creates a task that will take a one-shot. 
 */
void IRAM_ATTR ESP32Cam::_timerShotISR(void) {
  if (xTaskCreateUniversal(&ESP32Cam::_timerShotTask, ESP32CAM_GLOBAL_IDENTIFIER, ESP32CAM_TIMERTASK_STACKSIZE, (void*)ESP32Cam_internal::esp32cam, 1, NULL, CONFIG_ARDUINO_RUNNING_CORE) != pdPASS) {
    ESP_LOGE(ESP32CAM_LOGE_TAG, "TimerShot task failed");
  }
}

/**
 * The timer shot task operation runs as a task generated by the interrupt
 * routine. It reserves a semaphore in the first phase of the function to avoid
 * conflicting image sensor access with other tasks. The secured semaphore will
 * not be released until the captured image is exported to SD. In addition, the
 * timer will also stop temporarily.
 * @param  pvParameters  Current instance of ESP32Cam
 */
void ESP32Cam::_timerShotTask(void* pvParametes) {
  // Take a Mutex that avoids contention for image sensor resources.
  if (enq(portMAX_DELAY) == pdTRUE) {

    // Receive current instance of ESP32Cam
    ESP32Cam* esp32cam = reinterpret_cast<ESP32Cam*>(pvParametes);

    // Temporarily stop the timer during execution to suppress task overlap.
    timerStop(esp32cam->_hwTimer);

    // Assemble the file name of the destination of the captured image.
    char  fn[esp32cam->_captureName.length() + sizeof('\0') + 20];
    strcpy(fn, esp32cam->_captureName.c_str());
    esp32cam->_appendTimestamp(fn);

    // Capture and export to SD
    esp32cam->_export(fn, nullptr);

    // Release the resource and restart the timer increment.
    timerStart(esp32cam->_hwTimer);
    deq();
    // Purge itself
    vTaskDelete(NULL);
  }
}

/**
 * Temporarily stops the timerShot cycle.
 */
void ESP32Cam::disableTimerShot(void) {
  if (_hwTimer) {
    timerAlarmDisable(_hwTimer);
    switch (_mounted) {
    case MOUNT_SD: {
      fs::SDFS* sd = reinterpret_cast<fs::SDFS*>(_sdFile);
      sd->end();
      break;
    }
    case MOUNT_SDMMC: {
      fs::SDMMCFS*  sdmmc = reinterpret_cast<fs::SDMMCFS*>(_sdFile);
      sdmmc->end();
      break;
    }
    case MOUNT_NONE:
      break;
    }
  }
}

/**
 * Resume the shooting cycle of timerShot that has been temporarily stopped.
 */
void ESP32Cam::enableTimerShot(void) {
  if (_hwTimer) {
    switch (_mounted) {
    case MOUNT_SD: {
      fs::SDFS* sd = reinterpret_cast<fs::SDFS*>(_sdFile);
      sd->begin();
      break;
    }
    case MOUNT_SDMMC: {
      fs::SDMMCFS*  sdmmc = reinterpret_cast<fs::SDMMCFS*>(_sdFile);
      sdmmc->begin();
      break;
    }
    case MOUNT_NONE:
      break;
    }
    timerAlarmEnable(_hwTimer);
  }
}

/**
 * Release a semaphore.
 */
void ESP32Cam::deq(void) {
  xSemaphoreGive(ESP32Cam_internal::xMutex);
}

/**
 * Take a semaphore to prevent resource collisions with the image sensor.
 * ESP32Cam uses a semaphore for each of oneShot and timerShot to prevent image
 * sensor resources from colliding while performing each other's tasks. The enq
 * function reserves a semaphore to wait for a subsequent oneShot or timerShot.
 * @param  ms      File name to output the captured image
 * @return pdTRUE  Semaphore was reserved.
 * @return !pdTRUE Semaphore was not released within the specified `ms` time.
 */
portBASE_TYPE ESP32Cam::enq(TickType_t ms) {
  if (ms != portMAX_DELAY)
    ms = ms / portTICK_PERIOD_MS;
  return xSemaphoreTake(ESP32Cam_internal::xMutex, ms);
}

/**
 * Adds a timestamp that is part of the destination filename of the captured
 * image. The getLocalTime posted internally does not synchronize with the 
 * internet time. In order to reflect the exact time in the time stamp, it is
 * necessary to synchronize with Time Server using configTzTime.
 * @parama  eol  Timestamp string output destination.
 * @return  Ouput size
 */
size_t ESP32Cam::_appendTimestamp(char* str) {
  struct tm timeInfo;

  getLocalTime(&timeInfo);
  strftime(str + strlen(str), 20, "%FT%H_%M_%S", &timeInfo);
  return strlen(str);
}

/**
 * Detect the mount status of the SD card and remount it if it has been
 * unplugged once. This avoids sector information mismatch due to SD card
 * removal. It detects the mounting of the SD card by opening a dummy file in
 * write mode. For this reason, this strategy cannot correctly detect a
 * write-protected SD card.
 * This function also absorbs the different types of SDFS and SDMMCFS.
 * Maintains a pointer to the actual SD file system as an fs::FS variant and
 * notes the SD card type. When remounting, casts to the actual file system
 * according to the noted type.
 * @param  sdType  Actual mounted SD filesystem type
 * @param  sdFile  Filesystem that's mounted.
 * @return true    Filesystem mounted
 * @return false   Filesystem could not mounted
 */
bool ESP32Cam::_autoMount(const SDType_t sdType, fs::FS* sdFile) {
  bool  rc = false;

  switch (sdType) {
  case MOUNT_SD: {
    fs::SDFS* sd = reinterpret_cast<fs::SDFS*>(sdFile);
    if (sd->cardType() == CARD_NONE)
      rc = sd->begin();
    else {
      if (!sd->open(_mountProbe, FILE_WRITE)) {
        ESP_LOGD(ESP32CAM_LOGE_TAG, "SD mount point may have been removed, remounting");
        sd->end();
        rc = sd->begin();
      }
      else
        rc = sd->remove(_mountProbe);
    }
    if (rc)
      _sdFile = sd;
    break;
  }
  case MOUNT_SDMMC: {
    fs::SDMMCFS*  sdmmc = reinterpret_cast<fs::SDMMCFS*>(sdFile);
    if (sdmmc->cardType() == CARD_NONE)
      rc = sdmmc->begin();
    else {
      if (!sdmmc->open(_mountProbe, FILE_WRITE)) {
        ESP_LOGD(ESP32CAM_LOGE_TAG, "SDMMC mount point may have been removed, remounting");
        sdmmc->end();
        rc = sdmmc->begin();
      }
      else
        rc = sdmmc->remove(_mountProbe);
    }
    if (rc)
      _sdFile = sdmmc;
    break;
  }
  case MOUNT_NONE:
    break;
  }
  _mounted = rc ? sdType : MOUNT_NONE;
    
