Hieromon/AutoConnect/examples/WebCamServer/ESP32Cam.cpp
  return rc;
}

/**
 * Output the captured image to the _sd file system indicated by the current
 * instance.
 * If the file name to be exported does not have a proper extension, it will be
 * given an extension according to the ESP32CAM_EXPORT_FILEEXTENSION definition.
 * It also recovers mount points once lost by removing and inserting the SD card
 * by recursive invocation.
 * @param  filename    File name to output the captured image
 * @param  frameBuffer In the case of recursive calls for mount point recovery,
 * it will have the already allocated frame buffer address. Otherwise, nullptr.
 * @return ESP_OK      Successfully output
 * @return ESP_FAIL    Error has occurred
 */
esp_err_t ESP32Cam::_export(const char* filename, camera_fb_t* frameBuffer) {
  esp_err_t rc;

  // Obtain the captured frame buffer.
  // When called recursively, the frameBuffer will have already captured the image.
  if (!frameBuffer)
    frameBuffer = esp_camera_fb_get();

  if (frameBuffer) {
    // Give a proper extension to half-baked filename.
    char  fn[strlen(filename) + sizeof(ESP32CAM_EXPORT_FILEEXTENSION)];
    strcpy(fn, filename);
    const char* ext = strchr(fn, '.');
    bool  bc = ext != nullptr;
    if (bc)
      bc = strcmp(ext, ESP32CAM_EXPORT_FILEEXTENSION) == 0;
    if (!bc)
      strcat(fn, ESP32CAM_EXPORT_FILEEXTENSION);
    // Export
    File  pic = _sdFile->open(fn, FILE_WRITE);
    if (pic) {
      pic.write(frameBuffer->buf, frameBuffer->len);
      pic.close();
      rc = ESP_OK;
    }
    else {
      // If it fails to open the first time, it will try to remount the SD card;
      // if the SD card is just removed and inserted, this attempt will recover
      // the mount point.
      if (_mounted != MOUNT_NONE) {
        if ((rc = _autoMount(_mounted, _sdFile)) == ESP_OK)
          return _export(fn, frameBuffer);
        esp_camera_fb_return(frameBuffer);
        return rc;
      }
      ESP_LOGE(ESP32CAM_LOGE_TAG, "SD %s open failed", fn);
      rc = ESP_ERR_NOT_FOUND;
    }
    esp_camera_fb_return(frameBuffer);
  }
  else {
    ESP_LOGE(ESP32CAM_LOGE_TAG, "failed to esp_camera_fb_get");
    rc = ESP_FAIL;
  }

  return rc;
}

/**
 * Release a timer resource
 */
void ESP32Cam::_purgeTimer(void) {
  if (_hwTimer) {
    if (enq(portMAX_DELAY) == pdTRUE) {
      timerStop(_hwTimer);
      timerDetachInterrupt(_hwTimer);
      timerEnd(_hwTimer);
      _hwTimer = nullptr;
      deq();
    }
  }
}
